#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <pthread.h>

//输出斐波那契数列的最多项数
#define N 100
//每行最多显示的项数
#define MAX_LINE 10

//用于存储输出结果的全局变量
char result[1024];

//子线程开始执行的位置
void* thread_fibonacci(void* n)
{
    //斐波那契数列表，优化运行时间
    double fibonacci[N + 1] = { 0,
                                1.0, 1.0, 2.0, 3.0, 5.0, 
                                8.0, 13.0, 21.0, 34.0, 55.0, 
                                89.0, 144.0, 233.0, 377.0, 610.0, 
                                987.0, 1597.0, 2584.0, 4181.0, 6765.0, 
                                10946.0, 17711.0, 28657.0, 46368.0, 75025.0, 
                                121393.0, 196418.0, 317811.0, 514229.0, 832040.0, 
                                1346269.0, 2178309.0, 3524578.0, 5702887.0, 9227465.0, 
                                14930352.0, 24157817.0, 39088169.0, 63245986.0, 102334155.0, 
                                165580141.0, 267914296.0, 433494437.0, 701408733.0, 1134903170.0, 
                                1836311903.0, 2971215073.0, 4807526976.0, 7778742049.0, 12586269025.0, 
                                20365011074.0, 32951280099.0, 53316291173.0, 86267571272.0, 139583862445.0, 
                                225851433717.0, 365435296162.0, 591286729879.0, 956722026041.0, 1548008755920.0, 
                                2504730781961.0, 4052739537881.0, 6557470319842.0, 10610209857723.0, 17167680177565.0, 
                                27777890035288.0, 44945570212853.0, 72723460248141.0, 117669030460994.0, 190392490709135.0, 
                                308061521170129.0, 498454011879264.0, 806515533049393.0, 1304969544928657.0, 2111485077978050.0, 
                                3416454622906707.0, 5527939700884757.0, 8944394323791464.0, 14472334024676220.0, 23416728348467684.0, 
                                37889062373143904.0, 61305790721611584.0, 99194853094755488.0, 160500643816367072.0, 259695496911122560.0, 
                                420196140727489664.0, 679891637638612224.0, 1100087778366101888.0, 1779979416004713984.0, 2880067194370816000.0, 
                                4660046610375530496.0, 7540113804746346496.0, 12200160415121876992.0, 19740274219868225536.0, 31940434634990100480.0, 
                                51680708854858326016.0, 83621143489848426496.0, 135301852344706760704.0, 218922995834555203584.0, 354224848179261997056.0 };
    //将待输出的结果保存到全局变量中
    for (int i = 1; i <= *(int*)n; ++i)
    {
        //输出斐波那契数列第i项
        sprintf(result + strlen(result), "%.0lf", fibonacci[i]);
        //如果不是待输出的最后一项，输出逗号
        if (i != *(int*)n)
        {
            sprintf(result + strlen(result), ", ");
        }
        //如果输出完成，子线程退出
        else
        {
            sprintf(result + strlen(result), "\n");
            return NULL;
        }
        //控制每行输出的项数不超过MAX_LINE个，如果达到MAX_LINE个，换行
        if (0 == i % MAX_LINE)
        {
            sprintf(result + strlen(result), "\n");
        }
    }
}

//主函数
int main()
{
    //黄色字体显示提示信息
    printf("\033[33mPlease input the length of Fibonacci sequence (1~100): \033[0m");
    //从标准输入中读入待输出的项数
    int n;
    scanf("%d", &n);
    //检查输入是否合法
    if (n < 1 || n > 100)
    {
        fprintf(stderr, "\033[31millegal input\n\033[0m");
        exit(1);
    }
    //建立子线程
    pthread_t thread;
    //函数调用成功时返回0
    if (pthread_create(&thread, NULL, thread_fibonacci, (void*)&n))
    {
        fprintf(stderr, "\033[31mpthread_create failed\n\033[0m");
        exit(2);
    }
    //等待子线程结束
    if (pthread_join(thread, NULL))
    {
        fprintf(stderr, "\033[31mpthread_join failed\n\033[0m");
        exit(3);
    }
    //输出结果
    printf("%s", result);
}