#!/bin/bash
#UTF-8
#**************************************************************************
#名称：         main.sh
#作者：         吴同
#学号：         3170104848
#功能：         选择登录模式，调用相关模块。
#**************************************************************************

#显示登录选项菜单
#序号显示为紫色
echo -e "您的身份："
echo -e "\033[35m1 \033[0m学生"
echo -e "\033[35m2 \033[0m教师"
echo -e "\033[35m3 \033[0m管理员"
echo -e "\033[35mq \033[0m退出系统"

#输入登录模式，将该模块的文件包含进来，并调用模块的main函数
read mode
case $mode in
    1)  . ./student.sh
        main_student;;
    2)  . ./teacher.sh
        main_teacher;;
    3)  . ./admin.sh
        main_admin;;
    #正常退出程序
    q)  exit 0;;
    *)  echo -e "\033[31m输入非法！\033[0m"
        #登录界面输入非法退出程序
        exit 2;;
esac

#未知异常退出程序
exit 1